app/controllers/coda_dros_controller.rb

  def index
    @coda_dros = CodaDro.all
---
SELECT "coda_dros".* FROM "coda_dros"