app/controllers/cpu_eaters_controller.rb

SELECT "cpu_eaters".* FROM "cpu_eaters"
---
  def index
    @cpu_eaters = CpuEater.all

SELECT "cpu_eaters".* FROM "cpu_eaters" WHERE "cpu_eaters"."id" = 1 LIMIT 1
---
  def show
    @cpu_eater = CpuEater.find(params[:id])

SELECT "cpu_eaters".* FROM "cpu_eaters" WHERE "cpu_eaters"."id" = 1 LIMIT 1
---
  def edit
    @cpu_eater = CpuEater.find(params[:id])

INSERT INTO "cpu_eaters" ("pclk", "dclk", "aclk", "m2_vmain", "c2_m0_vmain", "one_core", "dual_core", "tri_core", "four_core", "created_at", "updated_at", "recname") VALUES (0, 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, '2013-08-12 11:03:23.575168', '2013-08-12 11:03:23.575168', 'fwu_test')
---
  def create
    @cpu_eater = CpuEater.new(params[:cpu_eater])

    respond_to do |format|
      if @cpu_eater.save